
		ЗАДАНИЕ:
На вход программе подается строка. Напишите программу, которая меняет регистр символов, 
другими словами замените все строчные символы заглавными и наоборот.
Формат входных данных 
На вход программе подается строка.
Формат выходных данных
Программа должна вывести строку в соответствии с условием задачи.






		РЕШЕНИЕ:
print(input().swapcase())



            

		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая определяет является ли оттенок текста хорошим или нет.
Текст имеет хороший оттенок, если содержит подстроку «хорош» во всевозможных регистрах.
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести «YES» если текст имеет хороший оттенок и «NO» в противном случае.
Примечание. Текст содержащий хорош, ХОРОШ, Хорош, хОРОШ и т.д. имеет хороший оттенок.



		РЕШЕНИЕ:
color = input().lower()
print('YES' if 'хорош' in color else 'NO')


		ЗАДАНИЕ:
На вход программе подается строка. Напишите программу, которая подсчитывает количество буквенных символов в нижнем регистре.
Формат входных данных 
На вход программе подается строка.
Формат выходных данных
Программа должна вывести количество буквенных символов в нижнем регистре.





		РЕШЕНИЕ:
color = input()
text = color.lower()
total = 0
for c in color:
    if c == text[0] and c.isalpha() == True:
        total += 1
    text = text[1:2] + text[2:]
print(total)







		ЗАДАНИЕ:



		РЕШЕНИЕ:




		ЗАДАНИЕ:



		РЕШЕНИЕ:




		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: