Дано натуральное число nn. Напишите программу, которая печатает численный треугольник с высотой равной nn, в соответствии с примером:

1
121
12321
1234321
123454321
...




		РЕШЕНИЕ:

x,y = int(input()),int(input())
total_x = 0
total_y =0
for i in range(x, y +1):
    if x % i == 0:
        total_x += i
    if y % i == 0:
        total_y += i
print(x if total_x > total_y else y, end = ' ')
print(total_x if total_x > total_y else total_y)


		ЗАДАНИЕ:




		РЕШЕНИЕ:



            

		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: