	ЗАДАЧА
	Python is awesome
Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.
Формат входных данных
Формат выходных данных
Программа должна вывести 10 раз текст «Python is awesome!», каждый на отдельной строке.

	РЕШЕНИЕ
print(*['Python is awesome!' for i in range(10)], sep='\n')

	ЗАДАЧА
Квадрат числа
На вход программе подается натуральное число n. Напишите программу, которая для каждого из чисел от 0 до n (включительно) выводит
фразу: «Квадрат числа [число] равен [число]» (без кавычек).
Формат входных данных
На вход программе подается натуральное число n.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

	РЕШЕНИЕ
for i in range(int(input()) + 1):
    print(f'Квадрат числа {i} равен {i * i}')