
		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой. Напишите программу, 
которая определяет является ли введенная строка текста корректным ip-адресом.
Формат входных данных
На вход программе подается строка текста, содержащая 4 целых числа разделенных точкой.
Формат выходных данных
Программа должна вывести «ДА», если введеная строка является корректным ip-адресом, и «НЕТ» — в противном случае.
Примечание. ip-адрес является корректным, если все 4 числа находятся в диапазоне от 0 до 255 включительно.


		РЕШЕНИЕ:
ip_adress = [i for i in input().split('.')]
total = 0
for i in ip_adress:
    if  int(i) <= 255 and int(i) >= 0:
        total += 1
print('ДА' if total == 4 else 'НЕТ')




		ЗАДАНИЕ:
На вход программе подается строка текста и строка разделитель. Напишите программу,
 которая вставляет указанный разделитель между каждым символом введенной строки текста.

Формат входных данных
На вход программе подается строка текста и строка разделитель, каждая на отдельной строке

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:
stringa = input()
print(input().join(stringa))







		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая целые числа. Напишите программу, 
которая по заданным числам строит столбчатую диаграмму.


Формат входных данных
На вход программе подается строка текста, содержащая целые числа, разделенных символом пробела.

Формат выходных данных
Программа должна вывести столбчатую диаграмму.


		РЕШЕНИЕ:
[print(*['+' * int(i) for i in input().split()], sep = '\n')]








		ЗАДАНИЕ:





		РЕШЕНИЕ:







		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: