
		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая имя, отчество и фамилию человека. Напишите программу, которая выводит инициалы человека.

Формат входных данных
На вход программе подается строка текста, содержащая имя, отчество и фамилию человека.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:
sp = [i[0] + '.' for i in input().split()]
print(*sp, sep = '')



		ЗАДАНИЕ:
В операционной системе Windows полное имя файла состоит из буквы диска, после которого ставится двоеточие и 
символ  "\",  затем через такой же символ перечисляются подкаталоги (папки), в которых находится файл,
в конце пишется имя файла (C:\Windows\System32\calc.exe).
На вход программе подается одна строка с корректным именем файла в операционной системе Windows.
Напишите программу, которая разбирает строку на части, разделенные символом "\". Каждую часть вывести в отдельной строке.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:
[print(*[i for i in input().split('\\')],sep = '\n')]






		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая целые числа. Напишите программу, 
которая по заданным числам строит столбчатую диаграмму.


Формат входных данных
На вход программе подается строка текста, содержащая целые числа, разделенных символом пробела.

Формат выходных данных
Программа должна вывести столбчатую диаграмму.


		РЕШЕНИЕ:
[print(*['+' * int(i) for i in input().split()], sep = '\n')]








		ЗАДАНИЕ:





		РЕШЕНИЕ:







		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: