На вход программе подается натуральное число nn. Напишите программу, выводящую графическое изображение 
делимости чисел от 11 до nn включительно. В каждой строке надо напечатать очередное число и столько символов «+», 
сколько делителей у этого числа.
Формат входных данных
На вход программе подается одно натуральное число.
Формат выходных данных
Программа должна вывести графическое изображение чисел от 11 до nn, каждое на отдельной строке.



		РЕШЕНИЕ:

a = int(input())
for i in range(1, a +1):
    num = 0
    for j in range(1, i +1):
        if i % j == 0:
            num += 1
    print(j, '+' * num, sep = '')


		ЗАДАНИЕ:
На вход программе подается натуральное число nn. Напишите программу, которая находит цифровой корень данного числа.
Цифровой корень числа n получается следующим образом: если сложить все цифры этого числа, затем все цифры найденной 
суммы и повторить этот процесс, то в результате будет получено однозначное число (цифра), которое и называется цифровым 
корнем данного числа.
Формат входных данных
На вход программе подается одно натуральное число.
Формат выходных данных
Программа должна вывести цифровой корень введенного числа.
Примечание. Используйте вложенные циклы while.




		РЕШЕНИЕ:

n = int(input())
while n > 9:
    x = n % 10
    y = n //10
    n = y + x
print(n)

            

		ЗАДАНИЕ:
На вход программе подается одна строка. Напишите программу, которая выводит элементы строки с индексами 0, 2, 4, ... в столбик.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести элементы строки с индексами 0, 2, 4, ..., каждое на отдельной строке.




		РЕШЕНИЕ:
x = input()
for c in range(0, len(x), 2):
    print(x[c])


		ЗАДАНИЕ:
На вход программе подается одна строка. Напишите программу, которая выводит в столбик элементы строки в обратном порядке.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести в столбик элементы строки в обратном порядке. 



		РЕШЕНИЕ:
x = input()
for i in range(1, len(x) + 1):
    print(x[-i])






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: