
		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая различные натуральные числа.
Из данной строки формируется список чисел. Напишите программу, которая меняет местами минимальный
и максимальный элемент этого списка.
Формат входных данных
На вход программе подается строка текста, содержащая различные натуральные числа, разделенные символом пробела.
Формат выходных данных
Программа должна вывести строку текста в соответствии с условием задачи.
Примечание. Используйте подходящие встроенные функции и списочные методы


		РЕШЕНИЕ:
sp = [int(i) for i in input().split(' ')]
if len(sp) > 1:
    multi_sp = sp.copy()
    x_min = sp.index(min(sp))
    y_max = sp.index(max(sp))
    if x_min > y_max:
        del sp[x_min], sp[y_max]
    else:
        del sp[y_max], sp[x_min]
    sp.insert(x_min, multi_sp[y_max])
    sp.insert(y_max, multi_sp[x_min])
    print(*sp)
else:
    print(*sp)



		ЗАДАНИЕ:



		РЕШЕНИЕ:







		ЗАДАНИЕ:



		РЕШЕНИЕ:








		ЗАДАНИЕ:





		РЕШЕНИЕ:







		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: