
		ЗАДАНИЕ:
На вход программе подается натуральное число nn, затем nn строк, затем еще одна строка — поисковый запрос. 
Напишите программу, которая выводит все введенные строки, в которых встречается поисковый запрос.

Формат входных данных
На вход программе подаются натуральное число nn — количество строк, затем сами строки в указанном количестве,
 затем один поисковый запрос.

Формат выходных данных
Программа должна вывести все введенные строки, в которых встречается поисковый запрос.

Примечание. Поиск не должен быть чувствителен к регистру символов.




		РЕШЕНИЕ:

text_sp = [input() for i in range(int(input()))]
metca = input()
multi_text = ''
for j in text_sp:
    multi_text = j.split()
    for k in multi_text:
        if k.lower() == metca.lower():
            print(*multi_text)
            

		ЗАДАНИЕ:



		РЕШЕНИЕ:





		ЗАДАНИЕ:


		РЕШЕНИЕ:








		ЗАДАНИЕ:





		РЕШЕНИЕ:







		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: