	ЗАДАЧА
Напишите программу, которая  принимает на вход три целых числа в одной строке через пробел и выводит их
последовательно через запятую как в примерах ниже

	РЕШЕНИЕ
print(*[int(i) for i in input().split()], sep=',')
# ^^
# a, b, c = map(int, input().split())
# print(a, b, c, sep=',')
	
	ЗАДАЧА
Вам необходимо вывести три фразы, разделяя их тремя дефисами. Сами фразы вводятся с клавиатуры на трех разных строчках


	РЕШЕНИЕ
print(*[input() for i in range(3)], sep='---')

	ЗАДАЧА
Программе поступает на вход одно целое положительное число, ваша задача вывести его последнюю цифру

	РЕШЕНИЕ
print([i for i in input()][-1])


