
		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая натуральные числа. Из данной строки формируется список чисел. Напишите программу, которая подсчитывает, сколько в полученном списке пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.

Формат входных данных
На вход программе подается строка текста, содержащая натуральные числа, отделенные символом пробела.

Формат выходных данных
Программа должна вывести одно число – количество пар элементов, равных друг другу.


		РЕШЕНИЕ:
def formula(x):
    return x * (x - 1) // 2


total = 0
multi_total = 0
stringa = input().split(' ')
sp = []
for i in stringa:
    if sp.count(i) != 0:
        continue
    if i == ' ':
        continue
    elif int(stringa.count(i)) > 1:
        total += int(stringa.count(i))
        multi_total += formula(total)
        total = 0
        sp.append(i)
    elif int(stringa.count(i)) == 1:
        continue
print(multi_total)



		ЗАДАНИЕ:



		РЕШЕНИЕ:







		ЗАДАНИЕ:



		РЕШЕНИЕ:








		ЗАДАНИЕ:





		РЕШЕНИЕ:







		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: