	ЗАДАЧА
IP адрес состоит из четырех чисел из диапазона от 0 до 255 (включительно) разделенных точкой.
Напишите функцию generate_ip(), которая с помощью модуля random  генерирует и возвращает случайный корректный IP адрес.
Примечание 1. Пример правильного (неправильного) IP адреса:

192.168.5.250        # правильный
199.300.521.255      # неправильный

	РЕШЕНИЕ
from random import *
def generate_ip():
    return f'{randrange(256)}.{randrange(256)}.{randrange(256)}.{randrange(256)}'

	ЗАДАЧА
Почтовый индекс в Латверии имеет вид: LetterLetterNumber_NumberLetterLetter, где Letter – заглавная буква английского алфавита, 
Number – число от 0 до 99 (включительно).
Напишите функцию generate_index(), которая с помощью модуля random генерирует и возвращает случайный корректный почтовый индекс Латверии.
Примечание 1. Пример правильного (неправильного) индекса Латверии:
AB23_56VG          # правильный
V3F_231GT          # неправильный
Примечание 2. Обратите внимание на символ _ в почтовом индексе.

	РЕШЕНИЕ
from random import *
def generate_index():
    x = ''.join([chr(i) for i in(sample([i for i in range(65, 91)], 2))])
    y = '_'.join((sample([str(i) for i in range(10)], 2)))
    return f'{x}{y}{x}'

	ЗАДАЧА
Напишите программу, которая с помощью модуля random генерирует 100 случайных номеров лотерейных билетов и выводит их каждый на отдельной 
строке. Обратите внимание, вы должны придерживаться следующих условий: номер не может начинаться с нулей;
номер лотерейного билета должен состоять из 7 цифр; все 100 лотерейных билетов должны быть различными.


	РЕШЕНИЕ
from random import *
multi_sp = set()
sp = []
while len(multi_sp) != 100:
    sp = randint(100_000_0, 999_999_9)
    multi_sp.add(sp)
print(*multi_sp, sep='\n')

	
	ЗАДАЧА
Анаграмма – это слово образованное путём перестановки букв, составляющих другое слово.
Например, слова пила и липа или пост и стоп – анаграммы.
Напишите программу, которая считывает одно слово и выводит с помощью модуля random его случайную анаграмму.
Примечание. Обратите внимание на то, что метод shuffle() работает со списком, а не со строкой.

	РЕШЕНИЕ
from random import *
word = [c for c in input()]
shuffle(word)
print(''.join(word))

	ЗАДАЧА
Для игры в бинго требуется карточка размером 5×5, содержащая различные (уникальные) целые числа от 1 до 75 (включительно), 
при этом центральная клетка является пустой (она заполняется числом 0).Игра-лото "Cупер Бинго". Играть в лотерею онлайн бесплатно
Напишите программу, которая с помощью модуля random генерирует и выводит случайную карточку для игры в бинго.
Примечание 1. Для наглядности рекомендуем отводить на вывод каждого числа ровно 3 символа. Для этого используйте строковый метод ljust().
Примечание 2. Пример возможного ответа:

1  16 31 46 61
10 30 42 47 68
3  18 0  48 63
9  19 34 49 70
5  20 35 50 65
Возможны и другие способы генерации карточки для игры в бинго.

	РЕШЕНИЕ
from random import *

sp = [i for i in range(1, 75)]
shuffle(sp)
for i in range(0, 25, 5):
    if i == 10:
        print(*sp[i:i + 2] + [0] + sp[i + 3:i + 5])
    else:
        print(*sp[i:i + 5])