
		ЗАДАНИЕ:
При анализе данных, собранных в рамках научного эксперимента, бывает полезно удалить самое большое
и самое маленькое значение.
На вход программе подается натуральное число nn, а затем nn различных натуральных чисел. Напишите программу, 
которая удаляет наименьшее и наибольшее значение из указанных чисел, а затем выводит оставшиеся числа каждое на отдельной строке, 
не меняя их порядок.
Формат входных данных
На вход программе подаются натуральное число nn, а затем nn различных натуральных чисел, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.




		РЕШЕНИЕ:

n = [int(input()) for i in range(int(input()))]
for _ in n:
    if _ == min(n):
        del _
        continue
    elif  _ == max(n):
        del _
        continue
    print(_)
            

		ЗАДАНИЕ:
На вход программе подается натуральное число nn, а затем nn строк. Напишите программу, 
которая выводит только уникальные строки, в том же порядке, в котором они были введены.

Формат входных данных
На вход программе подаются натуральное число nn, а затем nn строк, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Считайте, что все строки состоят из строчных символов.



		РЕШЕНИЕ:
text = [input() for i in range(int(input()))]
multi_text = []
[multi_text.append(i) for i in text if i not in multi_text]
print(*multi_text, sep = '\n')




		ЗАДАНИЕ:


		РЕШЕНИЕ:








		ЗАДАНИЕ:





		РЕШЕНИЕ:







		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: