
		ЗАДАНИЕ:
Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения, 
которые встречаются в нём более одного раза.

Для решения задачи может пригодиться метод sort списка.

Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.


		РЕШЕНИЕ:
sp = [int(i) for i in input().split()]
sp_cop = list()
for i in range(len(sp)):
    if sp.count(sp[i]) > 1 and sp[i] not in sp_cop:
       sp_cop.append(sp[i])
print(*sp_cop)




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:







		ЗАДАНИЕ:






		РЕШЕНИЕ:







		ЗАДАНИЕ:





		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:
.



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:
