				ЗАДАЧА:
				На easy
На вход программе подаются два целых числа a и b. Напишите программу, которая выводит:сумму чисел a и b;
разность чисел a и b;произведение чисел a и b;частное чисел a и b;целую часть от деления числа a на b;
остаток от деления числа a на b;
корень квадратный из суммы их 1010-х степеней: 10+10a 10+b 10
 
​Формат входных данных
На вход программе подаются два целых числа 

b ≠0, каждое на отдельной строке
Формат выходных данных
Программа должна вывести результаты математических операций в соответствии с условием задачи.

				РЕШЕНИЕ:
def sp_com_fist(a,b):
    import math
    return a + b, a - b, a * b, a / b, a // b, a % b, math.sqrt(a ** 10 + b ** 10)
print(*[i for i in sp_com_fist(int(input()), int(input()))], sep='\n')

				ЗАДАЧА:
			Индекс массы тела
Напишите программу для вычисления и оценки индекса массы тела (ИМТ) человека. ИМТ показывает весит человек больше или меньше 
нормы для своего роста. ИМТ человека рассчитывают по формуле:
ИМТ = масса(кг)/рост(м)×рост(м),где масса измеряется в килограммах, а рост — в метрах.

Масса человека считается оптимальной, если его ИМТ находится между 18.5 и 25. Если ИМТ меньше 18.5, то считается, 
что человек весит ниже нормы. Если значение ИМТ больше 25, то считается, что человек весит больше нормы.
Программа должна вывести "Оптимальная масса", если ИМТ находится между 18.5 и 25 (включительно). "Недостаточная масса", если ИМТ меньше 
18.5 и "Избыточная масса", если значение ИМТ больше 25.

Формат входных данных
На вход программе подается два числа: масса и рост человека, каждое на отдельной строке. Все входные числа являются вещественными,
используйте для них тип данных float.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

				РЕШЕНИЕ:

def body_mass_index(a, b):
    if 18.5 <= (a / (b * b)) <= 25:
        return "Оптимальная масса"
    elif 18.5 > (a / (b * b)):
        return "Недостаточная масса"
    else:
        return "Избыточная масса"
print(body_mass_index(float(input()), float(input())))
