		ЗАДАНИЕ:
Напишите программу, которая считывает последовательность из 10 целых чисел и определяет 
является ли каждое из них четным или нет.
Формат входных данных
На вход программе подаются 10 целых чисел, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести строку «YES», если все числа четные и «NO» в ином случае.



		РЕШЕНИЕ:
b = []
c = []
for _ in range(1,11):
   a =int(input())
   if a % 2 == 0:
       b.append(a) 
   else:
      c.append(a)
print("YES" if len(b) != 0 and len(c) == 0 else "NO")




		ЗАДАНИЕ:




		РЕШЕНИЕ:



            

		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: