
		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая определяет является ли введенная строка 
корректным телефонным номером. Строка текста является корректным телефонным номером если она имеет формат:
abc-def-hijk или
7-abc-def-hijk
где a, b, c, d, e, f, h, i, j, k – цифры от 0 до 9.
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести «YES» если строка является корректным телефонным номером и «NO» в противном случае.
Примечание. Телефонный номер должен содержать только цифры и символ -, а количество цифр в каждой группе должны быть правильным

		РЕШЕНИЕ:
sp = input()
multi_phone = list()
sp_2 = list()
sp_3 = ''
for i in range(len(sp)):
    if sp[i].isdigit() or sp[i] == '-':
        sp_2.append(sp[i])
        if len(sp) != len(sp_2):
            continue
        else:
            sp_3 = ''.join(map(str,sp_2))
            multi_phone = sp_3.split('-')
            if len(multi_phone) == 4:
                print('YES' if multi_phone[0] == '7' \
                and len(multi_phone[1]) == 3 and len(multi_phone[2]) == 3 \
                and len(multi_phone[3])== 4 else 'NO')
            elif len(multi_phone) == 3:
                print('YES' if len(multi_phone[0]) == 3 \
                and len(multi_phone[1]) == 3 and len(multi_phone[2]) == 4 else 'NO')
            else:
                print('NO')
    else:
        print('NO')
        break




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:







		ЗАДАНИЕ:






		РЕШЕНИЕ:







		ЗАДАНИЕ:





		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:
.



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:
