		ЗАДАНИЕ:
Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.
Формат входных данных
Формат выходных данных
Программа должна вывести 10 раз текст «Python is awesome!», каждый на отдельной строке.

		РЕШЕНИЕ:

for i in range(10):
    print('Python is awesome!')



		ЗАДАНИЕ:
Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет
данное предложение нужное количество раз.
Формат входных данных
В первой строке записано текстовое предложение, во второй — количество повторений.
Формат выходных данных
Программа должна вывести указанное текстовое предложение нужное количество раз. Каждое повторение должно начинаться с новой строки


		РЕШЕНИЕ:
a = input()
b = int(input())
for i in range(b):
    print(a)


            

		ЗАДАНИЕ:
Напишите программу, которая считывает одну строку текста и выводит 10 строк, пронумерованных от 0 до 9, 
каждая с указанной строкой текста.
Формат входных данных
На вход программе подается одна строка текста.
Формат выходных данных
Программа должна вывести десять строк в соответствии с условием задачи.




		РЕШЕНИЕ:
name = input()
for i in range(10):
    print(i, name)



		ЗАДАНИЕ:
На вход программе подается натуральное число nn. Напишите программу, которая для каждого из чисел от 00 до nn (включительно) 
выводит фразу: «Квадрат числа [число] равен [число]» (без кавычек).
Формат входных данных
На вход программе подается натуральное число nn.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:
x = int(input())
for _ in range(x):
    print('Квадрат числа', _, 'равен', int(pow(_,2)))
print('Квадрат числа', x, 'равен', int(pow(x,2)))





		ЗАДАНИЕ:
На вход программе подается натуральное число n \, (n \ge 2)n(n≥2) – катет прямоугольного равнобедренного треугольника.
Напишите программу, которая выводит звездный треугольник в соответствии с примером.
Формат входных данных
На вход программе подается одно натуральное число n \, (n \ge 2)n(n≥2).
Формат выходных данных
Программа должна вывести треугольник в соответствии с условием задачи.



		РЕШЕНИЕ:
x = int(input())
j = x
for _ in range(x):
    print('*'*j)
    j -= 1



		ЗАДАНИЕ:
На вход программе подается три натуральных числа m, \, p, \, nm,p,n:
m:m: стартовое количество организмов;
p:p: среднесуточное увеличение в %;
n:n: количество дней для размножения.
Напишите программу, которая предсказывает размер популяции организмов. Программа должна выводить 
размер популяции в каждый день, начиная с 11 и заканчивая nn-м днем.
Формат входных данных
На вход программе подается три натуральных числа.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

		РЕШЕНИЕ:

m = int(input())
p = int(input())
n = int(input())
for i in range(n):
    print(i + 1, m)
    m = m + p / 100 * m

		ЗАДАНИЕ:
Даны два целых числа mm и nn ( m \le nm≤n). Напишите программу, которая выводит все числа от mm до nn включительно.
Формат входных данных
На вход программе подаются два целых числа mm и nn, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести числа в соответствии с условием задачи.




		РЕШЕНИЕ:
m,n = int(input()),int(input())
if m <= n:
    for i in range(m,n +1):
        print(i)


		ЗАДАНИЕ:
Даны два целых числа mm и nn. Напишите программу, которая выводит все числа от mm до nn включительно
в порядке возрастания, если m < nm<n, или в порядке убывания в противном случае.
Формат входных данных
На вход программе подаются два целых числа mm и nn, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести числа в соответствии с условием задачи.


		РЕШЕНИЕ:
m,n = int(input()),int(input())
if m < n:
    for i in range(m,n +1):
        print(i)
else:
    for i in range(m,n -1,-1):
        print(i)


		ЗАДАНИЕ:
Даны два целых числа m и n (m >n). Напишите программу, которая выводит все нечетные числа
от m до n включительно в порядке убывания.
Формат входных данных
На вход программе подаются два целых числа mm и nn, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести числа в соответствии с условием задачи.
Примечание. Попробуйте решить задачу двумя способами: с использованием условного оператора if и без него.


		РЕШЕНИЕ:
m, n = int(input()), int(input())
start = ((m - 1) // 2) * 2 + 1
for i in range(start, n - 1, -2):
    print(i)


		ЗАДАНИЕ:
Дано натуральное число nn. Напишите программу, которая выводит таблицу умножения на nn.
Формат входных данных
На вход программе подается натуральное число.
Формат выходных данных
Программа должна вывести таблицу умножения на введенное число.
Примечание. В качестве знака умножения используйте английскую букву x.
		РЕШЕНИЕ:
x = int(input())
y = 1
for _ in range(1,11):
    print(x,'x', y,'=',x * y)
    y += 1

ЗАДАНИЕ:
РЕШЕНИЕ: