              ЗАДАНИЕ:
Напишите программу, которая принимает целое число xx и определяет, принадлежит ли данное число указанным промежуткам.
Формат входных данных
На вход программе подаётся целое число xx.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

              РЕШЕНИЕ:
x = int(input())
print('Не принадлежит' if -3 < x < 7 else 'Принадлежит')





              ЗАДАНИЕ:
Напишите программу, которая принимает целое число xx и определяет, принадлежит ли данное число указанным промежуткам.
Формат входных данных
На вход программе подаётся целое число xx.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



              РЕШЕНИЕ:

x = int(input())
print('Принадлежит' if -30 < x <= -2 or 7 < x <= 25 else 'Не принадлежит')
            

              ЗАДАНИЕ:
Назовем число красивым, если оно является четырехзначным и делится нацело на 77 или на 1717.
 Напишите программу, определяющую, является ли введённое число красивым. Программа должна вывести «YES»,
 если число является красивым, или «NO» в противном случае.
Формат входных данных
На вход программе подаётся натуральное число.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.


              РЕШЕНИЕ:
x = int(input())
print('YES' if 999 < x < 10000 and (x % 7 == 0 or x % 17 == 0) else 'NO')


	      ЗАДАНИЕ:
Напишите программу, которая принимает три положительных числа и определяет, существует ли невырожденный треугольник с такими сторонами.
Формат входных данных
На вход программе подаётся три положительных целых числа.
Формат выходных данных
Программа должна вывести «YES» или «NO» в соответствии с условием задачи.

	      РЕШЕНИЕ:
x,y,z = int(input()),int(input()),int(input())
if x < y +z and y < x + z and  z < x + y:
    print('YES')
else:
    print('NO')


		ЗАДАНИЕ:

Напишите программу, которая определяет, является ли год с данным номером високосным. 
Если год является високосным, то выведите «YES», иначе выведите «NO».
Год является високосным, если его номер кратен 4, но не кратен 100, или если он кратен 400.
Формат входных данных
На вход программе подаётся натуральное число.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.


		РЕШЕНИЕ:
x =int(input())
if x % 4 == 0 and x % 100 != 0 or x % 400 == 0:
    print('YES')
else:
    print('NO')


		ЗАДАНИЕ:
Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли ладья попасть
с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие 
номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», 
если из первой клетки ходом ладьи можно попасть во вторую, или «NO» в противном случае.
Формат входных данных
На вход программе подаётся четыре числа от 1 до 8.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
Примечание. Шахматная ладья ходит по горизонтали или вертикали.

		РЕШЕНИЕ:
x,y,z,j =int(input()),int(input()),int(input()),int(input())
if x == z and y != j or ( x != z and y == j):
    print('YES')
else:
    print('NO')

		ЗАДАНИЕ:
Даны две различные клетки шахматной доски. Напишите программу,  которая определяет, может ли король попасть с первой 
клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер 
строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки ходом
короля можно попасть во вторую, или «NO» в противном случае.
Формат входных данных
На вход программе подаётся четыре числа от 1 до 8.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
Примечание. Шахматный король ходит по горизонтали, вертикали и диагонали, но только на 1 клетку.


		РЕШЕНИЕ:
x,y,z,j =int(input()),int(input()),int(input()),int(input())
if (x == z +1 or x == z -1 or x == z) and (y == j +1 or y == j -1 or y == j):
	print('YES')
else:
    print('NO')

		ЗАДАНИЕ:
Даны три различных целых числа. Напишите программу, которая находит среднее по величине число.
Формат входных данных
На вход программе подаётся три различных целых числа, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести среднее число.
Примечание. Средним называется число, которое будет вторым, если три числа отсортировать в порядке возрастания

		РЕШЕНИЕ:
x = []
y = 0
while  y != 3:
    z =int(input())
    x.append(z)
    y +=1 
x.sort()
print(x[1])

		ЗАДАНИЕ:
Напишите программу, которая считывает с клавиатуры два целых числа и строку. Если эта строка является обозначением одной 
из четырёх математических операций (+, -, *, /), то выведите результат применения этой операции к введённым ранее числам, 
в противном случае выведите «Неверная операция». Если пользователь захочет поделить на ноль, выведите текст «На ноль делить нельзя!».
Формат входных данных
На вход программе подаются два целых числа, каждое на отдельной строке, и строка.
Формат выходных данных
Программа должна вывести результат применения операции к введенным числам или соответствующий текст, если операция неверная 
либо если происходит деление на ноль

		РЕШЕНИЕ:
x,y =int(input()),int(input())
z =input()

if y == 0 and z == '/':
    print('На ноль делить нельзя!')
elif z =='/':
    print(x / y)
elif z == '+':
    print(x + y)
elif z == '-':
    print(x - y)
elif z == '*':
    print(x * y)
else:
    print('Неверная операция')

ЗАДАНИЕ:
РЕШЕНИЕ:
ЗАДАНИЕ:
РЕШЕНИЕ: