
		ЗАДАНИЕ:
На вход программе подается одно число nn. Напишите программу, которая выводит список [1, 2, 3, ..., n].
Формат входных данных
На вход программе подается одно натуральное число.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.




		РЕШЕНИЕ:
n = int(input())
print(list(range(1, n + 1)))


            

		ЗАДАНИЕ:
На вход программе подается одно число nn. Напишите программу, которая выводит список, 
состоящий из nn букв английского алфавита ['a', 'b', 'c', ...] в нижнем регистре.
Формат входных данных
На вход программе подается натуральное число n, \, n \le 26n,n≤26.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.


		РЕШЕНИЕ:
n = int(input())
text = []
for i in range(1, n + 1):
    i = i + 96
    text.append(chr(i))
print(text)





		ЗАДАНИЕ:
Дополните приведенный код так, чтобы элемент списка имеющий значение Green заменился на значение Зеленый, 
а элемент Violet на Фиолетовый. Далее необходимо вывести полученный список.


		РЕШЕНИЕ:
rainbow = ['Red', 'Orange', 'Yellow', 'Green', 'Blue', 'Indigo', 'Violet']
rainbow[3], rainbow[6] = 'Зеленый', 'Фиолетовый'
print(rainbow)







		ЗАДАНИЕ:
Дополните приведенный код, чтобы он:

Вывел длину списка;
Вывел последний элемент списка;
Вывел список в обратном порядке (вспоминаем срезы);
Вывел YES если список содержит числа 5 и 17, и NO в противном случае;
Вывел список с удаленным первым и последним элементами.
Примечание. Каждый вывод осуществлять с новой строки.




		РЕШЕНИЕ:
numbers = [2, 6, 3, 14, 10, 4, 11, 16, 12, 5, 4, 16, 1, 0, 8, 16, 10, 10, 8, 5, 1, 11, 10, 10, 12, 0,
 0, 6, 14, 8, 2, 12, 14, 5, 6, 12, 1, 2, 10, 14, 9, 1, 15, 1, 2, 14, 16, 6, 7, 5]
print(len(numbers))
print(numbers[-1])
print(numbers[::-1])
print('YES' if 5 and 17 in numbers else 'NO')
print(numbers[1:-1])






		ЗАДАНИЕ:
Напишите программу, выводящую следующий список:
['a', 'bb', 'ccc', 'dddd', 'eeeee', 'ffffff', ...]
Формат выходных данных
Программа должна вывести указанный список.
Примечание. Последний элемент списка состоит из 26 символов z.



		РЕШЕНИЕ:
abc = []
total = 1
for i in range(97, 123):
    abc.append(chr(i) * total)
    total += 1
print(abc)





		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: