
		ЗАДАНИЕ:
Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... 
(число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n — столько элементов
последовательности должна отобразить программа. На выходе ожидается последовательность чисел, записанных через пробел в одну строку.

Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.



		РЕШЕНИЕ:
sp = [str(i).split() * int(i) for i in range(1, int(input()) + 1)]
x = list()
for i in sp:
    x.extend(i)
print(*x[:len(sp)])

		
		ЗАДАНИЕ:
Напишите программу, которая считывает список чисел 
lst из первой строки и число x из второй строки, которая выводит все позиции, на которых встречается число x в переданном списке lst.
Позиции нумеруются с нуля, если число x не встречается в списке, вывести строку "Отсутствует" (без кавычек, с большой буквы).
Позиции должны быть выведены в одну строку, по возрастанию абсолютного значения.



		РЕШЕНИЕ:
def index_number(x,y):
    x = [int(i) for i in sp.split()]
    y = n
    a = list()
    for i in range(len(x)):
        if x[i] == y:
            a.append(i)
    if len(a) > 0:
        return a
    else:
        return 'Отсутсвует'
sp, n = input(), int(input())
print(*index_number(sp, n))


		ЗАДАНИЕ:





		РЕШЕНИЕ:





		ЗАДАНИЕ:






		РЕШЕНИЕ:








		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:





		РЕШЕНИЕ:


		ЗАДАНИЕ:


		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:
