		ЗАДАНИЕ:
Дано натуральное число nn. Напишите программу, которая печатает численный треугольник с высотой равной nn, в соответствии с примером:

1
2 3
4 5 6
7 8 9 10
11 12 13 14 15
16 17 18 19 20 21
...




		РЕШЕНИЕ:
x = int(input())
total = 0
num = 0
num2 = 1
for i in range(1, x + 1):
    total = 0
    while total < i:
        num += 1
        total += 1
        print(num, sep =' ',end= ' ')
    if total == i:
        print()
        continue



		ЗАДАНИЕ:




		РЕШЕНИЕ:



            

		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: