	ЗАДАЧА

Входные данные
На вход программе в отдельных строках поступают два вещественных числа a и b: длина и ширина прямоугольника.
Выходные данные
Программа должна вывести через пробел два значения: сперва площадь S, а затем периметр P прямоугольника

	РЕШЕНИЕ
def sym(x, y):
    return x * y, 2 * (x + y)
print(*sym(float(input()), float(input())))

	ЗАДАЧА
Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками), 
заданного двумя значениями x1 и x2 (вещественные числа).

	РЕШЕНИЕ
x1, x2 = float(input()), float(input())
print(max(x1, x2) - min(x1, x2))