	ЗАДАЧА
Напишите программу, которая с помощью модуля random моделирует броски монеты. Программа принимает на вход количество попыток и 
выводит результаты бросков: Орел или Решка (каждое на отдельной строке).
Примечание. Например, при n=7 ваша программа может выводить:

	РЕШЕНИЕ
from random import *

n = int(input())    
for i in range(n):
    print('Орёл' if randint(0, 1) == 0 else 'Решка')

	ЗАДАЧА
Напишите программу, которая с помощью модуля random моделирует броски игрального кубика c 6 гранями. Программа принимает на вход 
количество попыток и выводит результаты бросков — выпавшее число, которое написано на грани кубика (каждое на отдельной строке).

	РЕШЕНИЕ
from random import randint
sp = [1,2,3,4,5,6]
for i in range(int(input())):
    print(sp[randint(0, 5)])

	ЗАДАЧА
Напишите программу, которая с помощью модуля random генерирует случайный пароль. Программа принимает на вход длину пароля и выводит 
случайный пароль, содержащий только символы английского алфавита a..z, A..Z (в нижнем и верхнем регистре).
Примечание 1. Символам A..Z английского языка соответствуют номера с 65 по 90 в таблице символов ASCII.
Примечание 2. Символам a..z английского языка соответствуют номера с 97 по 122 в таблице символов ASCII.
Примечание 3. Используйте функцию chr() для получения символа по его номеру в таблице символов ASCII.
Примечание 4. Например, при длине пароля, равной 15 символам ваша программа может выводить:
peJFAmhqfaAeKDu

	РЕШЕНИЕ
from random import randint
sp = []
n = int(input())
while len(sp) != n:
    x = randint(65, 123)
    if 65 <= x <= 90 or 97 <= x <= 122:
        sp.append(chr(x))
print(''.join(sp))
	
	ЗАДАЧА
Лотерейный билет содержит 7 чисел из диапазона от 1 до 49 (включительно).
Напишите программу, которая с помощью модуля random генерирует 7 различных случайных чисел для лотерейного билета.
Программа должна вывести числа в порядке возрастания на одной строке через один символ пробела.
Примечание. Убедитесь, что сгенерированные числа не содержат дубликатов.

	РЕШЕНИЕ
from random import *
sp = set()
while len(sp) != 7:
    sp.add(randint(1, 50))
print(*sorted(sp))
