	ЗАДАЧА
	Разность времен
Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени.
Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.
Входные данные
Программа на вход получает три целых числа: часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй 
момент времени.
Выходные данные
Выведите число секунд между этими моментами времени.

	РЕШЕНИЕ
def t_me(x, x1, x2):
    return (x * 3600) + (x1 * 60) + x2
a, b, c, a2, b2, c2 = [int(input()) for i in range(6)]
print(t_me(a2, b2, c2) - t_me(a, b, c))
	
	ЗАДАЧА
Напишите программу, которая вычисляет среднее арифметическое четырех введенных целых чисел.
Обратите внимание, что числа вводятся в одну строку через пробел

	РЕШЕНИЕ
sp = [int(i) for i in (input()).split()]
print(sum(sp) / len(sp))