
		ЗАДАНИЕ:


На вход программе подается строка генетического кода, состоящая из букв А (аденин), Г (гуанин), Ц (цитозин), Т (тимин).
Напишите программу, которая подсчитывает сколько аденина, гуанина, цитозина и тимина входит в данную строку генетического кода.
Формат входных данных 
На вход программе подается строка генетического кода, состоящая из символов А, Г, Ц, Т, а, г, ц, т.
Формат выходных данных
Программа должна вывести сколько гуанина, тимина, цитозина, аденина входит в данную строку генетического кода.
Примечание. Строка не содержит символов, кроме как А, Г, Ц, Т, а, г, ц, т.




		РЕШЕНИЕ:

text = input().lower()
total, total_1, total_2, total_3 = 0, 0, 0, 0
a, b, g, x = 'а', 'г', 'ц', 'т'
for c in text:
    if c == a:
        total += 1
    elif c == b:
        total_1 += 1
    elif c == g:
        total_2 += 1
    elif c == x:
        total_3 += 1
print('Аденин:', total)
print('Гуанин:', total_1)
print('Цитозин:', total_2)
print('Тимин:', total_3


            

		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:






		РЕШЕНИЕ:







		ЗАДАНИЕ:



		РЕШЕНИЕ:




		ЗАДАНИЕ:



		РЕШЕНИЕ:




		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: