
		ЗАДАНИЕ:
На вход программе подается строка текста в которой буква «h» встречается как минимум два раза. 
Напишите программу, которая возвращает исходную строку и переворачивает последовательность символов,
 заключенную между первым и последним вхождением буквы «h».
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:
text = input()
x = text.find('h')
y = text.rfind('h')
text_2 = text[x + 1 : y]
text_3 = text_2[:: -1]
final_text = text[:x + 1] + text_3 + text[y:]
print(final_text)

            

		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая выводит индекс второго вхождения буквы «f».
Если буква «f» встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:

text = input()
if text.count('f') == 0:
    print(-2)
elif text.count('f') == 1:
    print(-1)
else:
    text_2 = text.replace('f', 'a', 1)
    print(text_2.find('f'))



		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@».

Формат входных данных 
На вход программе подается строка текста.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.


		РЕШЕНИЕ:
text = input()
text_2 = ''
for i in range(0, len(text)):
    if text[i]  == '@':
        continue
    else:
        text_2 += text[i]
print(text_2)







		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая удаляет из нее все символы с индексами кратными 3, 
то есть символы с индексами 0, 3, 6, ....
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести строку текста в соответствии с условием задачи.




		РЕШЕНИЕ:
text = input()
text_2 = ''
for i in range(0, len(text)):
    if i % 3 == 0:
        continue
    else:
        text_2 += text[i]
print(text_2)





		ЗАДАНИЕ:
Легион Цезаря, созданный в 23 веке на основе Римской Империи не изменяет древним традициям и использует шифр Цезаря.
Это их и подвело, ведь данный шифр очень простой. Однако в постапокалипсисе люди плохо знают все тонкости довоенного мира, 
поэтому ученые из НКР не могут понять как именно нужно декодировать данные сообщения. Напишите программу для декодирования этого шифра.
Формат входных данных
В первой строке дается число n \, (1 \le n \le 25)n (1≤ n≤ 25) – сдвиг, во второй строке даётся закодированное сообщение 
в виде строки со строчными латинскими буквами.
Формат выходных данных
Программа должна вывести одну строку – декодированное сообщение. Обратите внимание, что нужно декодировать сообщение, а не закодировать.



		РЕШЕНИЕ:
n = int(input())
text = ''
for c in input():
    shift = ord(c) - 97
    if n > shift:
        shift_2 = n - shift
        shift_3 = 123 - shift_2
    else:
        shift_3 = ord(c) - n
    text += chr(shift_3)
print(text)




		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: