
		ЗАДАНИЕ:
На вход программе подается строка текста. Если в этой строке буква «f» встречается только один раз, 
выведите её индекс. Если она встречается два и более раз, выведите индекс её первого и последнего вхождения на одной строке,
разделенных символом пробела. Если буква «f» в данной строке не встречается, следует вывести «NO».
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.




		РЕШЕНИЕ:
text = input() 
total = 0
for c in text:
    if c == 'f':
        total += 1
if total == 1:
    print(text.find('f'))
elif total > 1:
    print(text.find('f'), text.rfind('f'))   
else:
    print('NO')

            

		ЗАДАНИЕ:
На вход программе подается строка текста, в которой буква «h» встречается минимум два раза. Напишите программу,
которая удаляет из этой строки первое и последнее вхождение буквы «h», а также все символы, находящиеся между ними.
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.




		РЕШЕНИЕ:
text = input() 
x = text.find('h')
y = text.rfind('h') + 1
print(text[0:x] + text[y:])




		ЗАДАНИЕ:
На вход программе подаются два числа aa и bb. Напишите программу, которая для каждого кодового значения в диапазоне 
от a до b (включительно), выводит соответствующий ему символ из таблицы символов Unicode.
Формат входных данных 
На вход программе подается два натуральных числа, каждое на отдельное строке.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.








		РЕШЕНИЕ:
a, b = int(input()), int(input())
c = 0 
for i in range(a, b +1):
    c += i
    print(chr(c), end = ' ')
    c = 0






		ЗАДАНИЕ:




		РЕШЕНИЕ:





		ЗАДАНИЕ:



		РЕШЕНИЕ:




		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: