
		ЗАДАНИЕ:
Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента
этого списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей считается элемент, 
находящий на противоположном конце этого списка. Например, если на вход подаётся список "1 3 5 6 10", 
о на выход ожидается список "13 6 9 15 7" (без кавычек).

Если на вход пришло только одно число, надо вывести его же.

Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.


		РЕШЕНИЕ:
def multi_sp(x):
    sp = [int(i) for i in x.split()]
    if len(sp) == 1:
        return sp
    else:
        return [sp[i - 1] + sp[0] if i == len(sp) - 1 else sp[i -1] + sp[i + 1] for i in range(len(sp))]
print(*multi_sp(input()))


		
		ЗАДАНИЕ:
Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел 
не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.
Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.
В примере мы считываем числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму
их квадратов, не обращая внимания на то, что остались ещё не прочитанные значения.



		РЕШЕНИЕ:
x = int(input())
sum_multi = x
sum_pow = x ** 2
while True:
    if sum_multi == 0:
        break
        print(x)
    x = int(input())
    sum_multi += x
    sum_pow += x ** 2
print(sum_pow)


		ЗАДАНИЕ:





		РЕШЕНИЕ:





		ЗАДАНИЕ:






		РЕШЕНИЕ:








		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:





		РЕШЕНИЕ:


		ЗАДАНИЕ:


		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:
