		ЗАДАНИЕ:
На вход программе подаются два целых числа aa и bb (a \le b)(a≤b). Напишите программу, 
которая подсчитывает количество чисел в диапазоне от aa до bb включительно, куб которых оканчивается на 44 или 99.
Формат входных данных
На вход программе подаются два целых числа aa и bb (a \le b)(a≤b).
Формат выходных данных
Программа должна вывести одно целое число в соответствии с условием программы.
Примечание. Куб числа aa – это его третья степень a^3a 



		РЕШЕНИЕ:
a,b = int(input()),int(input())
total = 0
for i in range(a,b+1):
    if i **3 % 10 == 4 or i **3 % 10 == 9:
        total += 1
print(total)




		ЗАДАНИЕ:
Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.
Формат входных данных
На вход программе подаются 10 целых чисел, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести произведение отличных от нуля чисел.
Примечание. Гарантируется, что хотя бы одно из 10 чисел является ненулевым.



		РЕШЕНИЕ:
total = 1
for i in range(1,11):
    a = int(input())
    if a != 0:
        total *= a
print(total)


            

		ЗАДАНИЕ:
На вход программе подается натуральное число nn. Напишите программу, которая вычисляет сумму всех его делителей.
Входные данные
На вход программе подается натуральное число nn.
Выходные данные
Программа должна вывести единственное число в соответствии с условием задачи.
Примечание. Функция подсчета суммы всех делителей числа является очень важной в теории чисел.




		РЕШЕНИЕ:
total = 0
a = int(input())
for i in range(1,a + 1):
    if a % i == 0:
        total += i
print(total)


		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: