
		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, использующую списочное выражение,
 которая находит длину самого длинного слова.

Формат входных данных
На вход программе подается строка текста.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

		РЕШЕНИЕ:
sp = [i for i in input().split()]
multi_passport = ''
total = 0
for c in range(len(sp)):
    
    if len(sp[c]) > total:
        total = len(sp[c])
print(total)


		
		ЗАДАНИЕ:

На вход программе подается строка текста. Напишите программу, использующую списочное выражение, 
которая преобразует каждое слово введенного текста в "молодежный жаргон" по следующему правилу: 
первая буква каждого слова удаляется и ставится в конец слова; 
затем в конец слова добавляется слог "ки".
Формат входных данных
На вход программе подается строка текста на русском языке.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:
print(*[i[1:] + i[0] + 'ки' for i in input().split()])



		ЗАДАНИЕ:
Напишите функцию draw_box(), которая выводит звездный прямоугольник с размерами 
14
×
10
14×10 в соответствии с образцом:

**********
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
**********
Примечание. Для вывода прямоугольника используйте цикл for.




		РЕШЕНИЕ:
def draw_box():
    for i in range(1, 15):
        if i == 1 or i == 14:
            print('*'*10)
        else:
            print('*',' ' *6, '*')
draw_box()






		ЗАДАНИЕ:
Напишите функцию draw_triangle(fill, base), которая принимает два параметра:

fill – символ заполнитель;
base – величина основания равнобедренного треугольника;
а затем выводит его.

Примечание. Гарантируется, что основание треугольника – нечетное число.





		РЕШЕНИЕ:
# объявление функции
def draw_triangle(fill, base):
    base = base // 2 + 1
    for i in range(1, base + 1):
        print(fill * i)
        if i == base:
            for j in range(base - 1, 0, -1):
                print(fill * j)

# считываем данные
fill = input()
base = int(input())

# вызываем функцию
draw_triangle(fill, base)





		ЗАДАНИЕ:
Напишите функцию print_fio(name, surname, patronymic), которая принимает три параметра:

name – имя человека;
surname – фамилия человека;
patronymic – отчество человека;
а затем выводит на печать ФИО человека.

Примечание. Предусмотрите тот факт, что все три буквы в ФИО должны иметь верхний регистр.




		РЕШЕНИЕ:
# объявление функции
def print_fio(a, b, c):
    print(b[0].upper(),a[0].upper(), c[0].upper(), sep = '')

# считываем данные
name, surname, patronymic = input(), input(), input()

# вызываем функцию
print_fio(name, surname, patronymic)



		ЗАДАНИЕ:
Напишите функцию print_digit_sum(), которая принимает одно целое число num и выводит на печать сумму его цифр.
.



		РЕШЕНИЕ:
def print_digit_sum(x):
    x = [int(i) for i in x]
    print(sum(x))
print_digit_sum(input())


		ЗАДАНИЕ:


		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:
