	ЗАДАЧА
Дополните приведенный код, чтобы он вывел имена всех пользователей (в алфавитном порядке), чей номер оканчивается на 8.
Примечание. Имена необходимо вывести на одной строке, разделяя символом пробела.

	РЕШЕНИЕ
d = []
for k in users:
    if k['phone'][-1] == '8':
        d.append(k['name'])
d.sort()
print(*d)

# # через генератор
# print(*sorted([i['name'] for i in users if i['phone'][-1] == '8']))




	ЗАДАЧА
Дополните приведенный код, чтобы он вывел имена всех пользователей (в алфавитном порядке), у которых нет информации об 
электронной почте. 
Примечание 1. Ключ email может отсутствовать в словаре.
Примечание 2. Имена необходимо вывести на одной строке, разделяя символом пробела.


	РЕШЕНИЕ
# sp = []
# for k in users:
#     if 'email' not in k or '@' not in k['email']:
#         sp.append(k['name'])
# print(*sorted(sp))
#
# через генератор
print(*sorted([key['name'] for key in users if 'email' not in key or '@' not in key['email']]))


	ЗАДАЧА
	Строковое представление
Напишите программу, которая будет превращать натуральное число в строку, заменяя все цифры в числе на слова:
0 на zero;
1 на one;
2 на two;
3 на three;
4 на four;
5 на five;
6 на six;
7 на seven;
8 на eight;
9 на nine.
Формат входных данных
На вход программе подается натуральное число.
Формат выходных данных
Программа должна вывести строковое представление числа.
Примечание. Используйте словарь вместо условного оператора.

	РЕШЕНИЕ
# d = [i for i in input()]
# for i in d:
#     print(d_ict[int(i)], end=' ')
### через генератор
print(*[d_ict[int(j)] for j in [i for i in input()]])



	ЗАДАЧА
Информация об учебных курсах
Напишите программу, которая по номеру курса выводит информацию о данном курсе. 
Номер курса (ключ)	Номер аудитории (значение)	Преподаватель (значение)	Время (значение)
CS101	3004	Хайнс	8:00
CS102	4501	Альварадо	9:00
CS103	6755	Рич	10:00
NT110	1244	Берк	11:00
CM241	1411	Ли	13:00
Формат входных данных
На вход программе подается одна строка – номер курса.
Формат выходных данных
Программа должна вывести номер курса, затем номер аудитории, имя преподавателя и время проведения курса в соответствии с примерами.

Примечание 1. Используйте словарь вместо условного оператора.

Примечание 2. Для удобного вывода используйте строковый метод format() или f-строки.



	РЕШЕНИЕ
d_ict = {'CS101': [3004, 'Хайнс', '8:00'],
         'CS102': [4501, 'Альварадо', '9:00'],
         'CS103': [6755, 'Рич', '10:00'],
         'NT110': [1244, 'Берк', '11:00'],
         'CM241': [1411, 'Ли', '13:00']
         }
str_s = input()
print(f'{str_s}:', f'{d_ict[str_s][0]},', f'{d_ict[str_s][1]},', f'{d_ict[str_s][2]}')


	ЗАДАЧА




	РЕШЕНИЕ





