		ЗАДАНИЕ:
На вход программе подается натуральное число nn, а затем nn различных натуральных чисел, 
каждое на отдельной строке. Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.
зФормат входных данных
На вход программе подаются натуральное число n \ge 2n≥2, а затем nn различных натуральных чисел, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести два наибольших числа, каждое на отдельной строке.




		РЕШЕНИЕ:

a = int(input())
b = []
for i in range(1,a + 1):
   b.append(int(input()))  
b.sort()
print(b[-1], b[-2], sep='\n')




		ЗАДАНИЕ:




		РЕШЕНИЕ:



            

		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: