
		ЗАДАНИЕ:

На вход программе подается одна строка состоящая из цифр. Напишите программу, 
которая считает сумму цифр данной строки.
Формат входных данных
На вход программе подается одна строка состоящая из цифр.
Формат выходных данных
Программа должна вывести сумму цифр данной строки.



		РЕШЕНИЕ:

a = input()
b = []
for i in a:
    b.append(int(i))
print(sum(b))

            

		ЗАДАНИЕ:
На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек), 
если строка содержит цифру. В противном случае вывести сообщение «Цифр нет» (без кавычек).
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.





		РЕШЕНИЕ:
a = input()
total = 0
for c in a:
    if c.isdigit():
        total += 1
print('Цифра' if total >= 1 else 'Цифр нет')


		ЗАДАНИЕ:
На вход программе подается одна строка. Напишите программу, которая определяет сколько раз в строке встречаются символы + и *.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести сколько раз встречаются символы  + и * в строке.




		РЕШЕНИЕ:
a = input()
total = 0
total_1 = 0
for c in a:
    if c == '+':
        total += 1
    elif c == '*':
        total_1 += 1
print('Символ + встречается', total, 'раз')
print('Символ * встречается', total_1, 'раз')





		ЗАДАНИЕ:
На вход программе подается одна строка. Напишите программу, которая определяет сколько в ней одинаковых соседних символов.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести количество одинаковых соседних символов.



		РЕШЕНИЕ:
a = input()
total = 0
x = ''
for c in a:
    if x == c:
        total += 1
    x = c
print(total)



		ЗАДАНИЕ:
На вход программе подается одна строка с буквами русского языка. Напишите программу, которая определяет
количество гласных и согласных букв.
Формат входных данных
На вход программе подается одна строка.
Формат выходных данных
Программа должна вывести количество гласных и согласных букв.
Примечание. В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е) и 
21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ)


		РЕШЕНИЕ:

a = input()
a = a.lower()
total_x = 0
total_y = 0
x = ['а', 'у', 'о', 'ы', 'и', 'э', 'я', 'ю', 'ё', 'е']
y = ['б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ']
for c in a:
    if c in x:
        total_x += 1
    elif c in y:
            total_y += 1
print('Количество гласных букв равно', total_x)
print('Количество согласных букв равно', total_y)


		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: