Дано натуральное число nn. Напишите программу, которая печатает численный треугольник с высотой равной nn, в соответствии с примером:

1
121
12321
1234321
123454321
...




		РЕШЕНИЕ:

x = int(input())
for i in range(x):
    for j in range(i +1):
        print(j +1, end='')
    
    for k in range(i, 0, -1):
        print(k , end='')
    print()


		ЗАДАНИЕ:




		РЕШЕНИЕ:



            

		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: