
		ЗАДАНИЕ:

Джим Хоппер с помощью радиоприемника пытается получить сообщение Оди. На приемник ему поступает n 
различных последовательностей кода Морзе. Декодировав их, он получает последовательности из цифр и
строчного латинского алфавита, при этом во всех сообщениях Оди содержится число 11, причем минимум 3 раза. 
Помогите определить Джиму количество сообщений от Оди.
Формат входных данных
В первой строке подаётся число n – количество сообщений, в последующих nn строках вводятся строки,
содержащие латинские строчные буквы и цифры.
Формат выходных данных
Программа должна вывести количество строк в которых содержится число 11 минимум 3 раза.
Примечание: Числа 11 необязательно должны быть разделены другими символами, нужно подсчитать вхождение 
последовательности символов "11", т.е. например в строке "111" содержится одна такая последовательность, 
в то время как в "1111" их уже две.



		РЕШЕНИЕ:

s = 0
total = 0
for i in range(1, int(input()) + 1):
    text = input()
    s = text.count('11')
    if  3 <= s:
        total +=1
print(total)
            

		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая подсчитывает количество цифр в данной строке.
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести количество цифр в данной строке.



		РЕШЕНИЕ:
total = 0
for i in input():
    if i.isdigit() == True:
        total += 1
print(total)



		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая проверяет, что строка заканчивается подстрокой .com или .ru.
Формат входных данных 
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести «YES» если введенная строка заканчивается подстрокой .com или .ru и «NO» в противном случае.






		РЕШЕНИЕ:
mail = input()
print('YES' if mail.endswith('.com') or mail.endswith('.ru') else 'NO')






		ЗАДАНИЕ:
На вход программе подается строка текста. Напишите программу, которая выводит на экран символ, который появляется наиболее часто.
Формат входных данных 
На вход программе подается строка текста. Текст может содержать строчные и заглавные буквы английского и русского алфавита, а также цифры.
Формат выходных данных
Программа должна вывести символ, который появляется наиболее часто.
Примечание 1. Если таких символов несколько, следует вывести последний по порядку символ.
Примечание 2. Следует различать заглавные и строчные буквы, а также буквы русского и английского алфавита.



		РЕШЕНИЕ:
total = 0
symbol = ''
final_total = 0
final_symbol = ''
text = input()
for c in text:
    if total > final_total:
        final_total = total
        final_symbol = symbol
    total = 0
    symbol = ''
    for i in text:
        if c == i:
            symbol = c
            total += 1
print(final_symbol)




		ЗАДАНИЕ:



		РЕШЕНИЕ:




		ЗАДАНИЕ:




		РЕШЕНИЕ:



		ЗАДАНИЕ:



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:

		РЕШЕНИЕ:


ЗАДАНИЕ:
РЕШЕНИЕ: