	ЗАДАЧА
	Система регистрации
В скором времени в Берляндии откроется новая почтовая служба "Берляндеск". Администрация сайта хочет запустить свой проект 
как можно быстрее, поэтому они попросили Вас о помощи. Вам предлагается реализовать прототип системы регистрации сайта.

Система должна работать по следующему принципу. Каждый раз, когда новый пользователь хочет зарегистрироваться, он посылает 
системе запрос name со своим именем. Если данное имя не содержится в базе данных системы, то оно заносится туда и пользователю 
возвращается ответ OK, подтверждающий успешную регистрацию. Если же на сайте уже присутствует пользователь с именем name, то система 
формирует новое имя и выдает его пользователю в качестве подсказки, при этом подсказка также добавляется в базу данных. Новое имя 
формируется по следующему правилу. К name последовательно приписываются числа, начиная с единицы (name1, name2, ...), и среди них 
находят такое наименьшее i, что namei не содержится в базе данных сайта.

Входные данные
В первой строке входных данных задано число n (1 ≤ n ≤ 105). Следующие n строк содержат запросы к системе. Каждый запрос представляет 
собой непустую строку длиной не более 32 символов, состоящую только из строчных букв латинского алфавита.

Выходные данные
В выходных данных должно содержаться n строк — ответы системы на запросы: OK в случае успешной регистрации, или подсказку с новым именем, 
если запрашиваемое уже занято.



	РЕШЕНИЕ
n = [input() for i in range(int(input()))]
d = {}
for c in n:
    if c in d:
        print(c + str(d[c]))
        d[c] += 1
    else:
        print('OK')
        d[c] = 1)




	ЗАДАЧА
Перед вами словарь workers
Ваша задача поднять зарплату Бреду до 8500 и затем вывести измененный словарь workers


	РЕШЕНИЕ
workers = {
    'employer1': {'name': 'Jhon', 'salary': 7500},
    'employer2': {'name': 'Emma', 'salary': 8000},
    'employer3': {'name': 'Brad', 'salary': 500}
}
person = [i for i in workers]
for i in person:
    if workers[i]['name'] == 'Brad':
        workers[i]['salary'] = 8500
print(workers)


	ЗАДАЧА
Мы уже с вами подсчитывали сколько раз встречается число в списке при помощи метода подсчета. Там мы использовали список для хранения 
найденного количества

Теперь ваша задача научиться использовать словарь для подсчета количества. Вашей программе поступает на вход строка, вам необходимо 
подсчитать сколько раз встретилась каждая буква в этой строке без учета регистра, при этом цифры и символы пунктуации нужно пропустить. 
Ответ нужно сохранить в словаре, в котором ключ - буква, а значение - количество раз, сколько эта буква встретилась в строке. В качестве 
ответа нужно вывести словарь



	РЕШЕНИЕ
n = [i for i in input()]
d = {}
for c in n:
    if c.lower() in d and c.isalpha():
        c = c.lower()
        d[c] += 1
    elif c.isalpha() == False:
        continue
    else:
        c = c.lower()
        d[c] = 1
print(d)


	ЗАДАЧА
	

	РЕШЕНИЕ






