
		ЗАДАНИЕ:
На вход программе подается четное число 
n,n≥2. Напишите программу, которая выводит список четных чисел

[2, 4, 6, ..., n].
Формат входных данных
На вход программе подается четное натуральное число.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



		РЕШЕНИЕ:

print([i for i in range(1, int(input())+1) if i % 2 == 0])

		ЗАДАНИЕ:
На вход программе подаются две строки текста, содержащие целые числа. Из данных строк формируются списки чисел L и M. Напишите программу, которая создает третий список, элементами которого являются суммы соответствующих элементов списков L и M. Далее программа должна вывести каждый элемент полученного списка на одной строке через 1 пробел.

Формат входных данных
На вход программе подаются две строки текста, содержащие целые числа, разделенные символом пробела.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Количество чисел в обеих строках одинаковое.




		РЕШЕНИЕ:
sp,sp_1 = [int(i) for i in input().split()],[int(i) for i in input().split()]
multi_sp = list()
x = len(sp)
for i in range(len(sp)):
    for j in range(len(sp_1)):
        multi_sp.append(sp[j]+sp_1[j])
    break
print(*multi_sp)






		ЗАДАНИЕ:
На вход программе подается строка текста, содержащая натуральные числа. Напишите программу, 
которая вставляет между каждым числом знак +, а затем вычисляет сумму полученных чисел.

Формат входных данных
На вход программе подается строка текста, содержащая натуральные числа, разделенные символом пробела.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Строковый метод join() работает только со списком строк.




		РЕШЕНИЕ:
sp = [int(i) for i in input().split()]
print(*sp,sep="+",end='=')
print(sum(sp))






		ЗАДАНИЕ:






		РЕШЕНИЕ:







		ЗАДАНИЕ:





		РЕШЕНИЕ:






		ЗАДАНИЕ:




		РЕШЕНИЕ:




		ЗАДАНИЕ:
.



		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:




		ЗАДАНИЕ:


		РЕШЕНИЕ:



		ЗАДАНИЕ:


		РЕШЕНИЕ:
