                           ЗАДАНИЕ:
Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы 
информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.
Кодирование осуществляется следующим образом:
s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот 
символ и количество его повторений в этой позиции строки.
Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную последовательность 
на стандартный вывод. Кодирование должно учитывать регистр символов.

                           РЕШЕНИЕ:
s = input()
s1 = ""
a = 0
b = s[0]
for i in s:
    if i == b:
        a += 1
    else:
        s1 += b + str(a)
        a = 1
        b = i
s1 += b + str(a)
print(s1)