                  ЗАДАНИЕ:
Вычислите сумму всех целых чисел на отрезке от a до b.

                  РЕШЕНИЕ:

a = int(input())
b = int(input())
summa = 0
index = a
while index <= b:
    summa += index
    index += 1
print(summa)

                ЗАДАНИЕ:
Напишите программу, которая считывает со стандартного ввода целые числа, по одному числу в строке,
и после первого введенного нуля выводит сумму полученных на вход чисел.

                РЕШЕНИЕ:
a = int(input())
summa = 0
index = a
while a != 0:
    summa += index
    a = int(input())
    index = a
print(summa)

