                        Таблица умноженения
for i in range(1,10):
    for j in range(1,10):
        print(f'{j*i:2}', end = ' ')
    print()

                         ЗАДАЧА:
Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. Для тренировок ему
бы очень пригодилась программа, которая показывала бы блок таблицы умножения.
Напишите программу, на вход которой даются четыре числа aa, bb, cc и dd, каждое в своей строке. Программа
должна вывести фрагмент таблицы умножения для всех чисел отрезка [a; b][a;b] на все числа отрезка [c;d][c;d].
Числа aa, bb, cc и dd являются натуральными и не превосходят 10, a \le ba≤b, c \le dc≤d.
Следуйте формату вывода из примера, для разделения элементов внутри строки используйте '\t' — символ табуляции.
Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков — заголовочные столбец и строка таблицы.

                         РЕШЕНИЕ:
a, b, c, d = int(input()), int(input()), int(input()), int(input())
for i in range(c, d + 1):
    print('\t', i, end = '')
for j in range(a, b + 1):
    print('\n', j, end = '')
    for g in range(c, d + 1):
        print('\t', j * g, end = '')
    print(end = '')