 
price = 0
while price < 5:
    a,b = input().split()
    a = int(a)
    b = int(b)
    if (a == 0) and (b == 0):
        break
#прерывает цикл
    if (a == 0) or (b == 0):
        continue
#продолжает цикл
    print(a * b)
    price += 1
#Метод split() принимает строку и возвращает список подстрок. 
#Синтаксис данного метода выглядит следующим образом:
#<string>.split(sep,maxsplit). По умолчанию через пробел


                            ЗАДАНИЕ:
Напишите программу, которая считывает целые числа с консоли по одному числу в строке.
Для каждого введённого числа проверить:
если число меньше 10, то пропускаем это число;
если число больше 100, то прекращаем считывать числа;
в остальных случаях вывести это число обратно на консоль в отдельной строке.

                             РЕШЕНИЕ:
a = 0
while  a <=100:
    a = int(input())
    if a < 10:
        continue
    if a > 100:
         break
    else:
        print(a)

